[Timeout] BlockStatement
src/Bank.ts:13:85
    * @param rate
    * @returns {Bank}
    */
-  static withExchangeRate (current: Currency, target: Currency, rate: number): Bank {
-    const bank = new Bank()
-    bank.addExchangeRate(current, target, rate)
-    return bank
-  }
+  static withExchangeRate (current: Currency, target: Currency, rate: number): Bank {}
 
   /**

[Timeout] BlockStatement
src/Bank.ts:25:77
    * @param rate
    * @returns {void}
    */
-  addExchangeRate (current: Currency, target: Currency, rate: number): void {
-    this._exchangeRates.set(current + '->' + target, rate)
-  }
+  addExchangeRate (current: Currency, target: Currency, rate: number): void {}
 
   /**

[Timeout] StringLiteral
src/Bank.ts:26:39
    * @returns {void}
    */
   addExchangeRate (current: Currency, target: Currency, rate: number): void {
-    this._exchangeRates.set(current + '->' + target, rate)
+    this._exchangeRates.set(current + "" + target, rate)
   }
 

[Killed] BlockStatement
src/Bank.ts:35:73
    * @param target
    * @returns {number}
    */
-  convert (amount: number, current: Currency, target: Currency): number {
-    if (!(current === target || this._exchangeRates.has(current + '->' + target))) { throw new MissingExchangeRateError(current, target) }
-
-    return target === current
-        ? amount
-        : amount * this._exchangeRates.get(current + '->' + target)
-  }
+  convert (amount: number, current: Currency, target: Currency): number {}
 }
 
killedBy: Bank convert from eur to usd returns number
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 12
Received: undefined

[Killed] EqualityOperator
src/Bank.ts:36:11
    * @returns {number}
    */
   convert (amount: number, current: Currency, target: Currency): number {
-    if (!(current === target || this._exchangeRates.has(current + '->' + target))) { throw new MissingExchangeRateError(current, target) }
+    if (!(current !== target || this._exchangeRates.has(current + '->' + target))) { throw new MissingExchangeRateError(current, target) }
 
     return target === current
killedBy: Bank convert from usd to usd returns same value
statusReason: Error: USD-> USD

[Killed] ConditionalExpression
src/Bank.ts:36:9
    * @returns {number}
    */
   convert (amount: number, current: Currency, target: Currency): number {
-    if (!(current === target || this._exchangeRates.has(current + '->' + target))) { throw new MissingExchangeRateError(current, target) }
+    if (false) { throw new MissingExchangeRateError(current, target) }
 
     return target === current
killedBy: Bank convert throws error in case of missing exchange rates
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: MissingExchangeRateError

Received function did not throw

[Killed] ConditionalExpression
src/Bank.ts:38:12
   convert (amount: number, current: Currency, target: Currency): number {
     if (!(current === target || this._exchangeRates.has(current + '->' + target))) { throw new MissingExchangeRateError(current, target) }
 
-    return target === current
+    return false
         ? amount
         : amount * this._exchangeRates.get(current + '->' + target)
killedBy: Bank convert from usd to usd returns same value
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10
Received: NaN

[Killed] EqualityOperator
src/Bank.ts:38:12
   convert (amount: number, current: Currency, target: Currency): number {
     if (!(current === target || this._exchangeRates.has(current + '->' + target))) { throw new MissingExchangeRateError(current, target) }
 
-    return target === current
+    return target !== current
         ? amount
         : amount * this._exchangeRates.get(current + '->' + target)
killedBy: Bank convert from eur to usd returns number
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 12
Received: 10

[Killed] ArithmeticOperator
src/Bank.ts:40:11
 
     return target === current
         ? amount
-        : amount * this._exchangeRates.get(current + '->' + target)
+        : amount / this._exchangeRates.get(current + '->' + target)
   }
 }
killedBy: Bank convert from eur to usd returns number
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 12
Received: 8.333333333333334
