[Killed] BlockStatement
src/MissingExchangeRateError.ts:4:53
 import { Currency } from './Currency'
 
 export class MissingExchangeRateError extends Error {
-  constructor (current: Currency, target: Currency) {
-    super(current + '-> ' + target)
-  }
+  constructor (current: Currency, target: Currency) {}
 }
 
killedBy: Bank convert throws error in case of missing exchange rates
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: MissingExchangeRateError
Received constructor: ReferenceError

Received message: "Must call super constructor in derived class before accessing 'this' or returning from derived constructor"

      53 |     } else {

[Killed] StringLiteral
src/MissingExchangeRateError.ts:5:21
 
 export class MissingExchangeRateError extends Error {
   constructor (current: Currency, target: Currency) {
-    super(current + '-> ' + target)
+    super(current + "" + target)
   }
 }
killedBy: Bank convert throws error in case of missing exchange rates
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "EUR-> KRW"
Received message:   "EURKRW"

       99 |         } else {
      100 |           stryCov_9fa48("13");
    > 101 |           throw new MissingExchangeRateError(current, target);
