[Killed] ArrowFunction
src/MoneyCalculator.ts:4:16
 import { Currency } from './Currency'
 
 export class MoneyCalculator {
-  static add = (amount: number, currency: Currency, amount2: number): number => amount + amount2
+  static add = () => undefined
   static times = (amount: number, currency: Currency, number: number): number => amount * number
   static divide = (amount: number, currency: Currency, value: number): number => amount / value
killedBy: Money add in usd returns number
statusReason: Error: expect(received).toBeNumber()

Expected value to be a number received:
  undefined

[Killed] ArithmeticOperator
src/MoneyCalculator.ts:4:81
 import { Currency } from './Currency'
 
 export class MoneyCalculator {
-  static add = (amount: number, currency: Currency, amount2: number): number => amount + amount2
+  static add = (amount: number, currency: Currency, amount2: number): number => amount - amount2
   static times = (amount: number, currency: Currency, number: number): number => amount * number
   static divide = (amount: number, currency: Currency, value: number): number => amount / value
killedBy: Money add in usd returns number
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 15
Received: -5

[Killed] ArrowFunction
src/MoneyCalculator.ts:5:18
 
 export class MoneyCalculator {
   static add = (amount: number, currency: Currency, amount2: number): number => amount + amount2
-  static times = (amount: number, currency: Currency, number: number): number => amount * number
+  static times = () => undefined
   static divide = (amount: number, currency: Currency, value: number): number => amount / value
 }
killedBy: Money multiply in eur returns positive number
statusReason: Error: expect(received).toBeNumber()

Expected value to be a number received:
  undefined

[Killed] ArithmeticOperator
src/MoneyCalculator.ts:5:82
 
 export class MoneyCalculator {
   static add = (amount: number, currency: Currency, amount2: number): number => amount + amount2
-  static times = (amount: number, currency: Currency, number: number): number => amount * number
+  static times = (amount: number, currency: Currency, number: number): number => amount / number
   static divide = (amount: number, currency: Currency, value: number): number => amount / value
 }
killedBy: Money multiply in eur returns positive number
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 20
Received: 5

[Killed] ArrowFunction
src/MoneyCalculator.ts:6:19
 export class MoneyCalculator {
   static add = (amount: number, currency: Currency, amount2: number): number => amount + amount2
   static times = (amount: number, currency: Currency, number: number): number => amount * number
-  static divide = (amount: number, currency: Currency, value: number): number => amount / value
+  static divide = () => undefined
 }
 
killedBy: Money divide in korean won returns number
statusReason: Error: expect(received).toBeNumber()

Expected value to be a number received:
  undefined

[Killed] ArithmeticOperator
src/MoneyCalculator.ts:6:82
 export class MoneyCalculator {
   static add = (amount: number, currency: Currency, amount2: number): number => amount + amount2
   static times = (amount: number, currency: Currency, number: number): number => amount * number
-  static divide = (amount: number, currency: Currency, value: number): number => amount / value
+  static divide = (amount: number, currency: Currency, value: number): number => amount * value
 }
 
killedBy: Money divide in korean won returns number
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1000.5
Received: 16008
